/**
	*
	*	@date
	*	@author
	*/
/*
*********************************************************************************************************
*                                                 MODULE
*
* Note(s) : (1) This header file is protected from multiple pre-processor inclusion through use of the
*               BSP_SER present pre-processor macro definition.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                              EXTERNS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                               DEFINES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                               INCLUDES
*********************************************************************************************************
*/

#ifndef __USART1_H__
#define __USART1_H__

#include <string.h>
#include "BSP.h"
/*
*********************************************************************************************************
*                                             RS-232 SERVICES
*********************************************************************************************************
*/
void  BSP_Uart1_Init (CPU_INT32U  baud_rate);
void BSP_Uart1_EnableTxE(void);
void  BSP_Uart1_WrByte(CPU_INT08U  c);
CPU_INT08U  BSP_Uart1_RdByte (void);
CPU_INT08U  BSP_Uart1_RdBytelock (CPU_INT32U Time,CPU_INT08U *rx_byte);
CPU_INT08U	 BSP_Uart1_SendCommand(const CPU_INT08U *Comand,\
											CPU_INT16U Length,\
											CPU_INT08U *Respons,\
											CPU_INT16U *ReLength,\
											CPU_INT16U WaitTime);
#define USART1_MAX_RECV_LEN		800					//最大接收缓存字节数
#define USART1_MAX_SEND_LEN		200					//最大发送缓存字节数
#define USART1_RX_EN 			1					//0,不接收;1,接收.

extern u8  USART1_RX_BUF[USART1_MAX_RECV_LEN]; 		//接收缓冲,最大USART2_MAX_RECV_LEN字节
extern u8  USART1_TX_BUF[USART1_MAX_SEND_LEN]; 		//发送缓冲,最大USART2_MAX_SEND_LEN字节
extern u16 USART1_RX_STA;   

#endif

/*
*********************************************************************************************************
*                                              MODULE END
*********************************************************************************************************
*/

